{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "name": "embedding_1", "activity_regularizer": null, "W_constraint": {"name": "UnitNorm", "axis": 0}, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 81547, "batch_input_shape": [null, 2645], "W_regularizer": null, "dropout": 0.0, "output_dim": 300, "input_length": 2645}}, {"class_name": "Reshape", "config": {"target_shape": [1, 2645, 300], "trainable": true, "name": "reshape_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 300, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 300, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "th", "pool_size": [2641, 1], "strides": [2641, 1], "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"p": 1, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 2}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_2"}}]}